week6/sandwichr-master/app/controllers/sandwiches_controller.rb

SELECT  "sandwiches".* FROM "sandwiches" WHERE "sandwiches"."id" = ? LIMIT 1  [["id", 1]]
SELECT "ingredients".* FROM "ingredients" INNER JOIN "sandwich_ingredients" ON "ingredients"."id" = "sandwich_ingredients"."ingredient_id" WHERE "sandwich_ingredients"."sandwich_id" = ?  [["sandwich_id", 1]]
---
	def show
	  sandwich = Sandwich.find_by(id: params[:id])
	  unless sandwich
	    render json: {error: "sandwich not found"},
	    status: 404
	    return
	  end
		# sandwich[:ingredients] = sandwich.ingredients.all
		sandwichPlusIngredients = {:sandwich => sandwich, :ingredients => sandwich.ingredients.all}

SELECT  "sandwiches".* FROM "sandwiches" WHERE "sandwiches"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "ingredients".* FROM "ingredients" WHERE "ingredient_id"."ingredient_id" = '3' LIMIT 1
SELECT "ingredients".* FROM "ingredients" INNER JOIN "sandwich_ingredients" ON "ingredients"."id" = "sandwich_ingredients"."ingredient_id" WHERE "sandwich_ingredients"."sandwich_id" = ?  [["sandwich_id", 2]]
---
	def add_ingredient
		sandwich = Sandwich.find_by(id: params[:id])
		ingredient = Ingredient.find_by(id: params[:ingredient][:id])
		sandwich.ingredients.push(ingredient)
		sandwich.save
		sandwichPlusIngredients = {:sandwich => sandwich, :ingredients => sandwich.ingredients.all}